export const scenario = `
（花鸟市场）

方圆：（画外音）这就是我，我叫方圆，您觉得名字熟吧，对没错，就是小别离里那个方圆，那会儿我四十二，今年我四十五了，跟那会儿的我比呢，有的多了点有的少了点，年龄多了点精力少了点，肚子大了点收入却少了点，那会儿我是医生，现在的职业跟医生也有点关系，我在一家医疗器械公司，您问我是不是老板啊，不不不，我连个总监都还没混上呢，不过我这岁数呢也就不指望了，每天看看鸟养养鱼，我也觉得挺好，我媳妇儿常说我胸无大志不求上进，小老百姓嘛能安居乐业也就够了，对对对说起我媳妇她还叫童文洁，也跟小别离里一样，她呀性格还是那么暴躁，脾气也还是那么急，标准的女强人，不过她也不怎么得志，就一公关公司的小领导，每天起早贪黑的工作很忙，所以比我挣的多了点儿，不过每天也要应付各种办公室里的勾心斗角，烦心事多着呢，但这些都不是最重要的，现在我们家里面临的最重要的问题是儿子，对就是儿子，不是朵朵了，您问为什么呀，其实方圆也好童文洁也好，就是个名字而已，在家里我们只有家长这一个身份，我们就是中国的街头巷尾最普通的爸爸和妈妈，我儿子今年高三了，明年就高考，我们全家可都围着他转呢，您问我们儿子叫什么呀，方一凡，喏就是他。

（春风中学）

方一凡：粉丝们大家早上好，今天是二零一八年八月十八日，距离正是开学还有两周，但是这群人已经上课两个礼拜了，为什么呢，假期补课呀，因为他们是特别悲催的高三学生，请看他们这一张张疲惫交加的脸，对了我呢就是方一凡，对我就是方圆和童文洁的儿子方一凡，哈喽大家好我很帅吧，春风中学吴亦凡了解一下，不过呢今天不是来了解我的我带大家了解高三这个战场的朋友们，你们好吗好吗。

校长：各位老师，还是那句话不经历风雨怎么见彩虹，咱们春风中学只是一所区重点，从中考中得到的生源非常有限，但是我们对人才的培养可以说是有目共睹，去年我们学校在连续第八年获得区教学质量优秀奖的基础上又实现了新的突破，文理本科率百分之百，一本上线率又上升了五个百分点达到了百分之六十七，今年还要继续拜托在座的各位老师再接再厉，咱们再出好成绩。

方一凡：来我给大家隆重介绍一下乔英子，我们学校的学霸，不是来采访你的，英子英子英子，哎呀配合我一下，来笑一个笑一个，你看你本来长得还挺可爱的对吧，可是呢你不是我的菜，英子英子英子，马上进入高三了你有什么感想吗说说。

乔英子：我觉得你要死。

方一凡：你看学霸都神志不清了让我们学渣怎么活呀。

校长：所以啊明天的这个誓师大会要搞得有新意，有创意有意义，让所有的参加者都能有体会有震动有领悟。

方一凡：我看到了一个熟悉的背影，这是我女神，女神女神女神，那个我有话对你说。

黄芷陶：你要说什么呀。

方一凡：我们不是已经高三了吗，就剩最后一年了你真的不考虑下我。

黄芷陶：你说什么呢你。

方一凡：你再不考虑就没时间了。

黄芷陶：大家都看着呢。

方一凡：来不及了。

李萌：校长对不起啊我打断一下。 

校长：你说。

李萌：去年呢我们的成绩确实很可观，所以今年我们更不能松懈，一定要一鼓作气趁热打铁更上一层楼，所以明天这个誓师大会呢还是要严肃认真，让学生们有紧迫感，马上进入备考状态。

校长：李老师，还是要以鼓励为主，不能太激进。

李萌：鼓励当然还是要有的，但每一届的学生情况不一样，就拿这次的高二期末考试来说吧，平均分比上一届低了五点七分，那么问题呢就出在这里，这张名单上的学生期末考试成绩都没有达到本科线，春风今年如果要想再创佳绩鼓励之余重点就是攻克这张名单，尤其是三班的季杨杨和方一凡。

保安：站住站住站住站住，下下下下来，干什么的你，你车怎么给我开进学校里了。

季杨杨：我就这儿的学生，我来返校的，为什么不能进来。

保安：学生学生你不穿校服，我告诉你只有教职工可以把车开进来，你不行，我这一不留神你怎么给开进来了。

季杨杨：我看校门开着呢，我以为是给我开的我就进来了，再说我就放个书包马上就下来。

保安：那也不行，你给我马上开出去，哪个班的班主任是谁。

季杨杨：把手放开手放开。

保安：行你给我等着啊别走，叫人去，队队长，这儿这儿有个有个小孩开了个车不走。

季杨杨：干吗呢。

方一凡：没有没有录像。

季杨杨：拍什么呢。

方一凡：没有，你这这没穿校服还把车开进来，这违反校规校纪。

季杨杨：拍什么呢。

方一凡：别动别动，呦这车不错啊，你推我，别推我，我跟你说在这分秒必争的高三什么都有可能出现。

季杨杨：拍什么呢你。

方一凡：这个呀就是最大的铅笔盒，里边钢笔铅笔什么都有你知道吧。

季杨杨：方一凡你骂谁呢。

乔英子：没事吧，陶子陶子。

方一凡：英子给我拿着，你敢打我女神。

季杨杨：干什么你。

黄芷陶：你别录了，方一凡别打啦。

乔英子：别打啦，行了你们差不多。

黄芷陶：行了你们别打啦。

乔英子：方一凡别打啦。

同学们：别打啦别打啦别打啦别打啦别打啦别打啦别打啦，好了好了好了好了别打啦方一凡行啦行啦。

方一凡：放开我。

同学们：别打啦方一凡行了行了。

季杨杨：方一凡你把我车划了。

方一凡：这车不是我划的，你身上那么多扣我身上什么都没有肯定你划的。

季杨杨：这明明就是你划的。

方一凡：不就是一道吗我用红笔给你涂一下就完了，赔你就是了。

季杨杨：拿笔涂，你赔得起吗你。

方一凡：你说什么你。

李萌：干什么干什么干什么你们俩，干什么你们，都高三了还打架。

（童文洁上班公司）

女同事：姐要不要把衣服脱了勒不勒呀。

童文洁：不勒，勒的话我还能少吃点，你说我也是我刚刚那句话就不该怼她，我怼她干吗呢。

女同事：你怼她什么了。

童文洁：不说了。

女同事：别不说呀你说呀你说什么了。

童文洁：是她刚刚说我回去几天可以当家庭妇女了，我一听这话什么意思呀，家庭妇女，我没饶她我说至少我还有家庭不像她纯妇女。

女同事：你说你跟她置什么气呀。

童文洁：不是啊我想想看我跟她置什么气，现在连个男朋友都没有，到老了谁管她呀，我不一样我有方一凡啊，虽然方一凡成绩不太好，但是我老了方一凡不会不管我吧，我那天算了一下就十年，这凡凡马上考大学了，争取考一好大学争取找一好工作进一好公司或者是自己出来创业，然后娶个好老婆，再给我生个一儿半女，我这辈子齐活了。

女同事：凡凡现在开始用功了吧，还有一年考大学了。

童文洁：凡凡呀凡凡什么都好就是这点不随我，你说当年我高考的时候我就跟打了鸡血似的，学习对我来说不算回事，我整宿整宿可以不睡是不是。

女同事：物理九十三数学九十二化学九十一。

童文洁：我除了英文稍微差一点，但我总分高啊。

女同事：你说他好。

童文洁：是不是凡凡学校的呀。（电话）喂你好，我是你好你好，啊方一凡打架了，那现在人没事吧，好好好好我马上过来。

女同事：怎么了怎么了。

童文洁：小浑蛋一天到晚给我惹事，我去趟学校你帮我盯一会儿。

女同事：行行行。

童文洁：我一会儿回来。

女同事：那你慢点。

童文洁：好。

（路上）

童文洁：什么情况啊熄火了，熄火了还是怎么了。

刘静：不好意思不好意思，我好多年都没开过车了，这这从我弟弟那儿借的车，我也不知道为什么它突然就熄火了。

童文洁：你是不是开了自动驻车功能啊。

刘静：什么功能。

童文洁：在那儿你看那个键。

刘静：这个吗。

童文洁：对你摁一下踩个油门试试，好。

刘静：好好好谢谢。

（春风中学）

李萌：行了整件事情的来龙去脉我都听清楚了（小小台词君），你们都是高三的学生啦，高三时间有多宝贵你们不知道吗，怎么还不把心思放在学习上呢，季杨杨你怎么把车开学校来了你有驾照吗，什么时候考的呀。

季杨杨：满十八了刚考的。

李萌：干吗呀。

方一凡：没有老师我帮你看一下别是个假本。

李萌：用不着你操心站过去，方一凡你说你是为了维护学校的秩序，学校秩序有老师有保卫处，你该好好上心的是你的学习成绩，你看这学校被你闹得沸沸扬扬的，季杨杨你中学生开这样的车你是要炫富吗，还把车开到学校里来严重违反校纪校规你知道吗。

季杨杨：不知道啊。

李萌：不知道，好，不知道好啊，一会儿啊你给我好好看看校规校纪背背中学生守则，笑什么还有你方一凡，你跟他一块好好学学怎么做高三的学生。

童文洁：真巧车没事了。

刘静：是你呀没事了没事了谢谢你。

童文洁：没事没事你也去春风啊。

刘静：对呀。

童文洁：你孩子也在这儿上学。

刘静：对呀。

童文洁：真巧我儿子也在这儿你孩子几年级呀。

刘静：高三了。

童文洁：哪个班。

刘静：三班啊。

童文洁：三班啊，我儿子也三班，我儿子叫方一凡你孩子叫什么。

刘静：我儿子叫季杨杨。

童文洁：季杨杨。

刘静：对。

童文洁：好像我听凡凡说过，对是不是每次开家长会来的都是他爸爸。

刘静：那是他舅舅。

童文洁：我说呢这么年轻。

李萌：（电话）喂，是我，好马上下来。

方一凡：老师谁呀。

李萌：别操心了你们回去写检查一人一千五百字。你好。

快递员：你好李萌吗。

李萌：对。

快递员：取货密码给我一下。

李萌：一零一九。

快递员：好对了谢谢。

童文洁：是李萌老师，我是方一凡妈妈，你刚刚给我打电话的。

李萌：一凡妈妈您好，我是他高三班主任。

童文洁：你好。

李萌：以后有什么事情就跟我对接。

童文洁：好的到底怎么回事。

李萌：你们家方一凡又惹祸了跟同学打架。

童文洁：跟谁打架。

李萌：跟季杨杨。

刘静：为什么打架。

李萌：您是。

刘静：我是季杨杨的妈妈。

李萌：我以为又是他舅舅来呢，那妈妈能来就更好了，季杨杨今天把车开进了学校严重违反了校规校纪。

刘静：实在抱歉啊这个情况我还不知道，两个孩子是因为这个打架的吗。

童文洁：受没受伤啊。

刘静：严重吗。

李萌：不严重也没受伤就是影响不好。

童文洁：不好意思杨杨妈妈我们家凡凡太调皮了真的不好意思动手打人真是抱歉抱歉。

刘静：不不不，是我们杨杨犯错想先再说了小孩子打架嘛都是闹着玩的。

童文洁：我估计肯定两个人说着说着就没搂住，起急了就动手了。

刘静：没事没事。

童文洁：抱歉抱歉。

李萌：行二位二位，其实今天叫你们来啊不光是为了打架的事还有一些更重要的事想跟你们商量一下，那咱们办公室聊吧好吗，走，你们平时是不是都挺忙的呀，没时间管孩子呀。

刘静：我是。

童文洁：我我还行啊，其实我们我跟他爸都管的，但是因为男孩子现在大了吧，没事，是小乌龟没事别怕别怕，我们家也有这个，还有字呢，祝李老师生日快乐健康长寿方一，你过生日啊，真不好意思估计凡凡是想祝你生日快乐，想让你健康长寿的意思，真是吓着你了这，李老师对不起啊，孩子不懂事他也是好心你别生气啊，方一凡。

方一凡：妈妈你追我干吗你慢点。

童文洁：你给我站住。

方一凡：妈妈妈你别追，我就是给个生日礼物。

童文洁：干什么你。

方一凡：哎呀妈。

童文洁：给我停下来。

方一凡：你别追了。

童文洁：别跑你给我站住，方一凡你给我停下来。

方一凡：我就我就给老师一个生日礼物。

童文洁：谁让你送的停下来。

李萌：来来来进来进来找地方坐。

童文洁：好好好。

李萌：来。

童文洁：谢谢谢谢我来我来我自己来。

李萌：来，实在是对不住啊今天有点太乱。

童文洁：没有没有没有是我造成的是我不好意思。

李萌：没有没有没有，那行那我就开门见山吧。

童文洁：好好好。

李萌：今天找您二位来呢刚才在校门口也说了不全是为了打架的事，高三马上开学了要分班，好几个孩子呢建议要蹲班，这蹲班的孩子里边就有季杨杨和方一凡，他们俩不仅学习跟不上还影响班里的学习气氛，所以今天请您二位家长过来商量一下，看看会不会考虑让孩子回高二再读一年。

童文洁：再读一年，可是上学期期末凡凡的成绩还可以吧。

李萌：是还可以，但是这分数有点尴尬升高三没问题的，但是想要达到本科线还差不少呢。

童文洁：是这样的有个情况你可能不知道，整个暑假他爸都在给他报班，给他补习呢，所以您这不是这学期的摸底测试还没还没考吗，像这种蹲班这种决定是不是应该等摸底考试结束了以后再决定啊。

李萌：对对对，摸底考试开学以后就考，所以嘛今天就请二位家长过来没做决定呢，跟你们商量一下也是提前打个招呼。

童文洁：我还有一个就是因为我不太懂啊这个蹲班就是是我理解的留级吗。

李萌：对是留级。

童文洁：那要是留级我可能不太能接受，除了成绩以外凡凡还有一个他生日比别人大，你你再留一级他比别的孩子大两岁，等他毕业的时候这我怕他他心理有有阴影。

刘静：对对对李老师，季杨杨的情况呢就更复杂了一点，更特殊一点，他读小学的时候呢就身体特别弱，就比别的孩子晚读了一年，你看如果他再留级的话那毕业的时候就比其他的孩子都大了两岁啊，这个情况恐怕我们也是不能接受的。

李萌：是是你们说的呢也都有道理，是这样的就是今天这个情况呢你们也看见了，主要是这两个孩子的心思呀压根就没在学习上。

童文洁：这，我我我这个我知道，但是咱们不是还有一年吗，而且我和他爸爸也会好好管他，咱们一起再努努力我觉得孩子还是有希望的是不是。

李萌：对还是有希望的，您也别太激动了，我今天就是请二位过来商量一下也是提前打个招呼没做决定呢。

刘铮：（电话）喂姐过来没有啊我这等你半天了。

刘静：是不是你给他的车。

刘铮：是啊。

刘静：你给他车就算了你还给他这么好的车，他爸爸最讨厌他玩车了，更别说开到学校这不惹祸吗。

刘铮：杨杨惹祸啦。

刘静：可不吗打架了。

刘铮：打架了，杨杨没事吧，伤着没有啊，在学校是吧那我现在过去。

刘静：你在那儿等着我吧不用过来了，我这边已经处理完了。

刘铮：那我在这儿等着你。

刘静：好好好我现在就过来啊。

——待更——

如需整理电视剧《小欢喜》更多集文稿，可找公众号【小小台词君】 作者：差点相信你 https://www.bilibili.com/read/cv22552222/ 出处：bilibili
`;

export function formatScenario(scenario: string) {
  const scenarioLinesArr = scenario.split('\n\n');
}
